{"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "base1_input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 227, 227, 3], "dtype": "float32", "sparse": false, "name": "base1_input_1"}, "inbound_nodes": []}, {"name": "base2_input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 227, 227, 3], "dtype": "float32", "sparse": false, "name": "base2_input_2"}, "inbound_nodes": []}, {"name": "base3_input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 227, 227, 3], "dtype": "float32", "sparse": false, "name": "base3_input_3"}, "inbound_nodes": []}, {"name": "base1_conv1", "class_name": "Conv2D", "config": {"name": "base1_conv1", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base1_input_1", 0, 0, {}]]]}, {"name": "base2_conv1", "class_name": "Conv2D", "config": {"name": "base2_conv1", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base2_input_2", 0, 0, {}]]]}, {"name": "base3_conv1", "class_name": "Conv2D", "config": {"name": "base3_conv1", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base3_input_3", 0, 0, {}]]]}, {"name": "base1_conv1_bn", "class_name": "BatchNormalization", "config": {"name": "base1_conv1_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base1_conv1", 0, 0, {}]]]}, {"name": "base2_conv1_bn", "class_name": "BatchNormalization", "config": {"name": "base2_conv1_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base2_conv1", 0, 0, {}]]]}, {"name": "base3_conv1_bn", "class_name": "BatchNormalization", "config": {"name": "base3_conv1_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base3_conv1", 0, 0, {}]]]}, {"name": "base1_conv1_relu", "class_name": "Activation", "config": {"name": "base1_conv1_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base1_conv1_bn", 0, 0, {}]]]}, {"name": "base2_conv1_relu", "class_name": "Activation", "config": {"name": "base2_conv1_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base2_conv1_bn", 0, 0, {}]]]}, {"name": "base3_conv1_relu", "class_name": "Activation", "config": {"name": "base3_conv1_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base3_conv1_bn", 0, 0, {}]]]}, {"name": "base1_conv_dw_1", "class_name": "DepthwiseConv2D", "config": {"name": "base1_conv_dw_1", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base1_conv1_relu", 0, 0, {}]]]}, {"name": "base2_conv_dw_1", "class_name": "DepthwiseConv2D", "config": {"name": "base2_conv_dw_1", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base2_conv1_relu", 0, 0, {}]]]}, {"name": "base3_conv_dw_1", "class_name": "DepthwiseConv2D", "config": {"name": "base3_conv_dw_1", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base3_conv1_relu", 0, 0, {}]]]}, {"name": "base1_conv_dw_1_bn", "class_name": "BatchNormalization", "config": {"name": "base1_conv_dw_1_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base1_conv_dw_1", 0, 0, {}]]]}, {"name": "base2_conv_dw_1_bn", "class_name": "BatchNormalization", "config": {"name": "base2_conv_dw_1_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base2_conv_dw_1", 0, 0, {}]]]}, {"name": "base3_conv_dw_1_bn", "class_name": "BatchNormalization", "config": {"name": "base3_conv_dw_1_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base3_conv_dw_1", 0, 0, {}]]]}, {"name": "base1_conv_dw_1_relu", "class_name": "Activation", "config": {"name": "base1_conv_dw_1_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base1_conv_dw_1_bn", 0, 0, {}]]]}, {"name": "base2_conv_dw_1_relu", "class_name": "Activation", "config": {"name": "base2_conv_dw_1_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base2_conv_dw_1_bn", 0, 0, {}]]]}, {"name": "base3_conv_dw_1_relu", "class_name": "Activation", "config": {"name": "base3_conv_dw_1_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base3_conv_dw_1_bn", 0, 0, {}]]]}, {"name": "base1_conv_pw_1", "class_name": "Conv2D", "config": {"name": "base1_conv_pw_1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base1_conv_dw_1_relu", 0, 0, {}]]]}, {"name": "base2_conv_pw_1", "class_name": "Conv2D", "config": {"name": "base2_conv_pw_1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base2_conv_dw_1_relu", 0, 0, {}]]]}, {"name": "base3_conv_pw_1", "class_name": "Conv2D", "config": {"name": "base3_conv_pw_1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base3_conv_dw_1_relu", 0, 0, {}]]]}, {"name": "base1_conv_pw_1_bn", "class_name": "BatchNormalization", "config": {"name": "base1_conv_pw_1_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base1_conv_pw_1", 0, 0, {}]]]}, {"name": "base2_conv_pw_1_bn", "class_name": "BatchNormalization", "config": {"name": "base2_conv_pw_1_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base2_conv_pw_1", 0, 0, {}]]]}, {"name": "base3_conv_pw_1_bn", "class_name": "BatchNormalization", "config": {"name": "base3_conv_pw_1_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base3_conv_pw_1", 0, 0, {}]]]}, {"name": "base1_conv_pw_1_relu", "class_name": "Activation", "config": {"name": "base1_conv_pw_1_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base1_conv_pw_1_bn", 0, 0, {}]]]}, {"name": "base2_conv_pw_1_relu", "class_name": "Activation", "config": {"name": "base2_conv_pw_1_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base2_conv_pw_1_bn", 0, 0, {}]]]}, {"name": "base3_conv_pw_1_relu", "class_name": "Activation", "config": {"name": "base3_conv_pw_1_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base3_conv_pw_1_bn", 0, 0, {}]]]}, {"name": "base1_conv_dw_2", "class_name": "DepthwiseConv2D", "config": {"name": "base1_conv_dw_2", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base1_conv_pw_1_relu", 0, 0, {}]]]}, {"name": "base2_conv_dw_2", "class_name": "DepthwiseConv2D", "config": {"name": "base2_conv_dw_2", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base2_conv_pw_1_relu", 0, 0, {}]]]}, {"name": "base3_conv_dw_2", "class_name": "DepthwiseConv2D", "config": {"name": "base3_conv_dw_2", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base3_conv_pw_1_relu", 0, 0, {}]]]}, {"name": "base1_conv_dw_2_bn", "class_name": "BatchNormalization", "config": {"name": "base1_conv_dw_2_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base1_conv_dw_2", 0, 0, {}]]]}, {"name": "base2_conv_dw_2_bn", "class_name": "BatchNormalization", "config": {"name": "base2_conv_dw_2_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base2_conv_dw_2", 0, 0, {}]]]}, {"name": "base3_conv_dw_2_bn", "class_name": "BatchNormalization", "config": {"name": "base3_conv_dw_2_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base3_conv_dw_2", 0, 0, {}]]]}, {"name": "base1_conv_dw_2_relu", "class_name": "Activation", "config": {"name": "base1_conv_dw_2_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base1_conv_dw_2_bn", 0, 0, {}]]]}, {"name": "base2_conv_dw_2_relu", "class_name": "Activation", "config": {"name": "base2_conv_dw_2_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base2_conv_dw_2_bn", 0, 0, {}]]]}, {"name": "base3_conv_dw_2_relu", "class_name": "Activation", "config": {"name": "base3_conv_dw_2_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base3_conv_dw_2_bn", 0, 0, {}]]]}, {"name": "base1_conv_pw_2", "class_name": "Conv2D", "config": {"name": "base1_conv_pw_2", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base1_conv_dw_2_relu", 0, 0, {}]]]}, {"name": "base2_conv_pw_2", "class_name": "Conv2D", "config": {"name": "base2_conv_pw_2", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base2_conv_dw_2_relu", 0, 0, {}]]]}, {"name": "base3_conv_pw_2", "class_name": "Conv2D", "config": {"name": "base3_conv_pw_2", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base3_conv_dw_2_relu", 0, 0, {}]]]}, {"name": "base1_conv_pw_2_bn", "class_name": "BatchNormalization", "config": {"name": "base1_conv_pw_2_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base1_conv_pw_2", 0, 0, {}]]]}, {"name": "base2_conv_pw_2_bn", "class_name": "BatchNormalization", "config": {"name": "base2_conv_pw_2_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base2_conv_pw_2", 0, 0, {}]]]}, {"name": "base3_conv_pw_2_bn", "class_name": "BatchNormalization", "config": {"name": "base3_conv_pw_2_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base3_conv_pw_2", 0, 0, {}]]]}, {"name": "base1_conv_pw_2_relu", "class_name": "Activation", "config": {"name": "base1_conv_pw_2_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base1_conv_pw_2_bn", 0, 0, {}]]]}, {"name": "base2_conv_pw_2_relu", "class_name": "Activation", "config": {"name": "base2_conv_pw_2_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base2_conv_pw_2_bn", 0, 0, {}]]]}, {"name": "base3_conv_pw_2_relu", "class_name": "Activation", "config": {"name": "base3_conv_pw_2_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base3_conv_pw_2_bn", 0, 0, {}]]]}, {"name": "base1_conv_dw_3", "class_name": "DepthwiseConv2D", "config": {"name": "base1_conv_dw_3", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base1_conv_pw_2_relu", 0, 0, {}]]]}, {"name": "base2_conv_dw_3", "class_name": "DepthwiseConv2D", "config": {"name": "base2_conv_dw_3", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base2_conv_pw_2_relu", 0, 0, {}]]]}, {"name": "base3_conv_dw_3", "class_name": "DepthwiseConv2D", "config": {"name": "base3_conv_dw_3", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base3_conv_pw_2_relu", 0, 0, {}]]]}, {"name": "base1_conv_dw_3_bn", "class_name": "BatchNormalization", "config": {"name": "base1_conv_dw_3_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base1_conv_dw_3", 0, 0, {}]]]}, {"name": "base2_conv_dw_3_bn", "class_name": "BatchNormalization", "config": {"name": "base2_conv_dw_3_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base2_conv_dw_3", 0, 0, {}]]]}, {"name": "base3_conv_dw_3_bn", "class_name": "BatchNormalization", "config": {"name": "base3_conv_dw_3_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base3_conv_dw_3", 0, 0, {}]]]}, {"name": "base1_conv_dw_3_relu", "class_name": "Activation", "config": {"name": "base1_conv_dw_3_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base1_conv_dw_3_bn", 0, 0, {}]]]}, {"name": "base2_conv_dw_3_relu", "class_name": "Activation", "config": {"name": "base2_conv_dw_3_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base2_conv_dw_3_bn", 0, 0, {}]]]}, {"name": "base3_conv_dw_3_relu", "class_name": "Activation", "config": {"name": "base3_conv_dw_3_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base3_conv_dw_3_bn", 0, 0, {}]]]}, {"name": "base1_conv_pw_3", "class_name": "Conv2D", "config": {"name": "base1_conv_pw_3", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base1_conv_dw_3_relu", 0, 0, {}]]]}, {"name": "base2_conv_pw_3", "class_name": "Conv2D", "config": {"name": "base2_conv_pw_3", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base2_conv_dw_3_relu", 0, 0, {}]]]}, {"name": "base3_conv_pw_3", "class_name": "Conv2D", "config": {"name": "base3_conv_pw_3", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base3_conv_dw_3_relu", 0, 0, {}]]]}, {"name": "base1_conv_pw_3_bn", "class_name": "BatchNormalization", "config": {"name": "base1_conv_pw_3_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base1_conv_pw_3", 0, 0, {}]]]}, {"name": "base2_conv_pw_3_bn", "class_name": "BatchNormalization", "config": {"name": "base2_conv_pw_3_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base2_conv_pw_3", 0, 0, {}]]]}, {"name": "base3_conv_pw_3_bn", "class_name": "BatchNormalization", "config": {"name": "base3_conv_pw_3_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base3_conv_pw_3", 0, 0, {}]]]}, {"name": "base1_conv_pw_3_relu", "class_name": "Activation", "config": {"name": "base1_conv_pw_3_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base1_conv_pw_3_bn", 0, 0, {}]]]}, {"name": "base2_conv_pw_3_relu", "class_name": "Activation", "config": {"name": "base2_conv_pw_3_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base2_conv_pw_3_bn", 0, 0, {}]]]}, {"name": "base3_conv_pw_3_relu", "class_name": "Activation", "config": {"name": "base3_conv_pw_3_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base3_conv_pw_3_bn", 0, 0, {}]]]}, {"name": "base1_conv_dw_4", "class_name": "DepthwiseConv2D", "config": {"name": "base1_conv_dw_4", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base1_conv_pw_3_relu", 0, 0, {}]]]}, {"name": "base2_conv_dw_4", "class_name": "DepthwiseConv2D", "config": {"name": "base2_conv_dw_4", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base2_conv_pw_3_relu", 0, 0, {}]]]}, {"name": "base3_conv_dw_4", "class_name": "DepthwiseConv2D", "config": {"name": "base3_conv_dw_4", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base3_conv_pw_3_relu", 0, 0, {}]]]}, {"name": "base1_conv_dw_4_bn", "class_name": "BatchNormalization", "config": {"name": "base1_conv_dw_4_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base1_conv_dw_4", 0, 0, {}]]]}, {"name": "base2_conv_dw_4_bn", "class_name": "BatchNormalization", "config": {"name": "base2_conv_dw_4_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base2_conv_dw_4", 0, 0, {}]]]}, {"name": "base3_conv_dw_4_bn", "class_name": "BatchNormalization", "config": {"name": "base3_conv_dw_4_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base3_conv_dw_4", 0, 0, {}]]]}, {"name": "base1_conv_dw_4_relu", "class_name": "Activation", "config": {"name": "base1_conv_dw_4_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base1_conv_dw_4_bn", 0, 0, {}]]]}, {"name": "base2_conv_dw_4_relu", "class_name": "Activation", "config": {"name": "base2_conv_dw_4_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base2_conv_dw_4_bn", 0, 0, {}]]]}, {"name": "base3_conv_dw_4_relu", "class_name": "Activation", "config": {"name": "base3_conv_dw_4_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base3_conv_dw_4_bn", 0, 0, {}]]]}, {"name": "base1_conv_pw_4", "class_name": "Conv2D", "config": {"name": "base1_conv_pw_4", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base1_conv_dw_4_relu", 0, 0, {}]]]}, {"name": "base2_conv_pw_4", "class_name": "Conv2D", "config": {"name": "base2_conv_pw_4", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base2_conv_dw_4_relu", 0, 0, {}]]]}, {"name": "base3_conv_pw_4", "class_name": "Conv2D", "config": {"name": "base3_conv_pw_4", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base3_conv_dw_4_relu", 0, 0, {}]]]}, {"name": "base1_conv_pw_4_bn", "class_name": "BatchNormalization", "config": {"name": "base1_conv_pw_4_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base1_conv_pw_4", 0, 0, {}]]]}, {"name": "base2_conv_pw_4_bn", "class_name": "BatchNormalization", "config": {"name": "base2_conv_pw_4_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base2_conv_pw_4", 0, 0, {}]]]}, {"name": "base3_conv_pw_4_bn", "class_name": "BatchNormalization", "config": {"name": "base3_conv_pw_4_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base3_conv_pw_4", 0, 0, {}]]]}, {"name": "base1_conv_pw_4_relu", "class_name": "Activation", "config": {"name": "base1_conv_pw_4_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base1_conv_pw_4_bn", 0, 0, {}]]]}, {"name": "base2_conv_pw_4_relu", "class_name": "Activation", "config": {"name": "base2_conv_pw_4_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base2_conv_pw_4_bn", 0, 0, {}]]]}, {"name": "base3_conv_pw_4_relu", "class_name": "Activation", "config": {"name": "base3_conv_pw_4_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base3_conv_pw_4_bn", 0, 0, {}]]]}, {"name": "base1_conv_dw_5", "class_name": "DepthwiseConv2D", "config": {"name": "base1_conv_dw_5", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base1_conv_pw_4_relu", 0, 0, {}]]]}, {"name": "base2_conv_dw_5", "class_name": "DepthwiseConv2D", "config": {"name": "base2_conv_dw_5", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base2_conv_pw_4_relu", 0, 0, {}]]]}, {"name": "base3_conv_dw_5", "class_name": "DepthwiseConv2D", "config": {"name": "base3_conv_dw_5", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["base3_conv_pw_4_relu", 0, 0, {}]]]}, {"name": "base1_conv_dw_5_bn", "class_name": "BatchNormalization", "config": {"name": "base1_conv_dw_5_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base1_conv_dw_5", 0, 0, {}]]]}, {"name": "base2_conv_dw_5_bn", "class_name": "BatchNormalization", "config": {"name": "base2_conv_dw_5_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base2_conv_dw_5", 0, 0, {}]]]}, {"name": "base3_conv_dw_5_bn", "class_name": "BatchNormalization", "config": {"name": "base3_conv_dw_5_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base3_conv_dw_5", 0, 0, {}]]]}, {"name": "base1_conv_dw_5_relu", "class_name": "Activation", "config": {"name": "base1_conv_dw_5_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base1_conv_dw_5_bn", 0, 0, {}]]]}, {"name": "base2_conv_dw_5_relu", "class_name": "Activation", "config": {"name": "base2_conv_dw_5_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base2_conv_dw_5_bn", 0, 0, {}]]]}, {"name": "base3_conv_dw_5_relu", "class_name": "Activation", "config": {"name": "base3_conv_dw_5_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["base3_conv_dw_5_bn", 0, 0, {}]]]}, {"name": "base1_conv_pw_5", "class_name": "Conv2D", "config": {"name": "base1_conv_pw_5", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base1_conv_dw_5_relu", 0, 0, {}]]]}, {"name": "base2_conv_pw_5", "class_name": "Conv2D", "config": {"name": "base2_conv_pw_5", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base2_conv_dw_5_relu", 0, 0, {}]]]}, {"name": "base3_conv_pw_5", "class_name": "Conv2D", "config": {"name": "base3_conv_pw_5", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["base3_conv_dw_5_relu", 0, 0, {}]]]}, {"name": "base1_conv_pw_5_bn", "class_name": "BatchNormalization", "config": {"name": "base1_conv_pw_5_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base1_conv_pw_5", 0, 0, {}]]]}, {"name": "base2_conv_pw_5_bn", "class_name": "BatchNormalization", "config": {"name": "base2_conv_pw_5_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base2_conv_pw_5", 0, 0, {}]]]}, {"name": "base3_conv_pw_5_bn", "class_name": "BatchNormalization", "config": {"name": "base3_conv_pw_5_bn", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["base3_conv_pw_5", 0, 0, {}]]]}, {"name": "base1_conv_pw_5_relu", "class_name": "Activation", "config": {"name": "base1_conv_pw_5_relu", "trainable": true, 